Catalogs/КлассификаторСырьяГИСМТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КлассификаторСырьяГИСМТ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СоответствиеНоменклатурыСырьяГИСМТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыСырьяГИСМТ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сырье</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСырьяГИСМТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КлассификаторСырьяГИСМТ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает текст запроса получения информации о сопоставлении сырья номенклатуре.
//
// Возвращаемое значение:
//   Строка - текст запроса
//
Функция ТекстЗапросаИнформацияОСопоставлении() Экспорт
		
	ТекстЗапроса = "ВЫБРАТЬ
	|	СоответствиеНоменклатурыСырьяГИСМТ.Сырье КАК Сырье,
	|	СоответствиеНоменклатурыСырьяГИСМТ.Номенклатура КАК Номенклатура,
	|	СоответствиеНоменклатурыСырьяГИСМТ.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ СопоставленныеПозиции
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатурыСырьяГИСМТ КАК СоответствиеНоменклатурыСырьяГИСМТ
	|ГДЕ
	|	СоответствиеНоменклатурыСырьяГИСМТ.Сырье В (&Сырье)
	|СГРУППИРОВАТЬ ПО
	|	СоответствиеНоменклатурыСырьяГИСМТ.Сырье,
	|	СоответствиеНоменклатурыСырьяГИСМТ.Номенклатура,
	|	СоответствиеНоменклатурыСырьяГИСМТ.Характеристика
	|ИНДЕКСИРОВАТЬ ПО
	|	Сырье
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СопоставленныеПозиции.Сырье КАК Сырье,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ СопоставленоПозиций
	|ИЗ
	|	СопоставленныеПозиции КАК СопоставленныеПозиции
	|СГРУППИРОВАТЬ ПО
	|	СопоставленныеПозиции.Сырье
	|ИНДЕКСИРОВАТЬ ПО
	|	Сырье
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(СопоставленоПозиций.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(СопоставленныеПозиции.Номенклатура, &ПустаяНоменклатура) КАК Номенклатура,
	|	ЕСТЬNULL(СопоставленныеПозиции.Характеристика, &ПустаяХарактеристика) КАК Характеристика,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(СопоставленныеПозиции.Номенклатура, &ПустаяНоменклатура)) КАК НоменклатураПредставление
	|ИЗ
	|	Справочник.КлассификаторСырьяГИСМТ КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ СопоставленоПозиций КАК СопоставленоПозиций
	|		ПО (СопоставленоПозиций.Сырье = Товары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СопоставленныеПозиции КАК СопоставленныеПозиции
	|		ПО (СопоставленныеПозиции.Сырье = Товары.Ссылка)
	|ГДЕ
	|	Товары.Ссылка В (&Сырье)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Данные объекта.
// 
// Параметры:
//  ЭлементДанных - Структура - Элемент данных из API ГИС МТ: id, type, name
// 
// Возвращаемое значение:
//  Структура - Данные объекта:
// * Идентификатор - Строка
// * Тип - Число
// * Наименование - Строка
//
Функция ДанныеОбъекта(ЭлементДанных) Экспорт
	
	ДанныеСырья = Новый Структура();
	
	ДанныеСырья.Вставить("Идентификатор", Строка(ЭлементДанных.id));
	ДанныеСырья.Вставить("Тип",           ЭлементДанных.type);
	ДанныеСырья.Вставить("Наименование",  ЭлементДанных.name);
	
	Возврат ДанныеСырья;
	
КонецФункции

// Загрузить объекты по данным из API ГИС МТ.
//
// Параметры:
//  ДанныеСырья - Массив из см. ДанныеОбъекта, Соответствие из КлючИЗначение, Структура
Процедура СоздатьОбновитьСырьеПоДаннымСервиса(ДанныеСырья) Экспорт
	
	ИсточникДанных = Новый ТаблицаЗначений;
	ИсточникДанных.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ИсточникДанных.Колонки.Добавить("Тип",           ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ИсточникДанных.Колонки.Добавить("Наименование",  ОбщегоНазначения.ОписаниеТипаСтрока(150));
	Если ТипЗнч(ДанныеСырья) = Тип("Структура") Тогда
		НоваяСтрока = ИсточникДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСырья);
	ИначеЕсли ТипЗнч(ДанныеСырья) = Тип("Массив") Тогда
		Для Каждого ЭлементКоллекции Из ДанныеСырья Цикл
			НоваяСтрока = ИсточникДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементКоллекции);
		КонецЦикла;
	Иначе // Соответствие
		Для Каждого КлючИЗначение Из ДанныеСырья Цикл
			НоваяСтрока = ИсточникДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ИсточникДанных.Свернуть("Идентификатор, Тип, Наименование");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсточникДанных.Идентификатор КАК Идентификатор,
	|	ИсточникДанных.Тип КАК Тип,
	|	ИсточникДанных.Наименование КАК Наименование
	|ПОМЕСТИТЬ ИсточникДанных
	|ИЗ
	|	&ИсточникДанных КАК ИсточникДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсточникДанных.Идентификатор КАК Идентификатор,
	|	ИсточникДанных.Наименование КАК Наименование,
	|	ЕСТЬNULL(КлассификаторСырья.Ссылка, НЕОПРЕДЕЛЕНО) КАК Ссылка,
	|	ИсточникДанных.Тип КАК Тип
	|ИЗ
	|	ИсточникДанных КАК ИсточникДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСырьяГИСМТ КАК КлассификаторСырья
	|		ПО ИсточникДанных.Идентификатор = КлассификаторСырья.Идентификатор
	|ГДЕ
	|	КлассификаторСырья.Ссылка ЕСТЬ NULL
	|	ИЛИ КлассификаторСырья.ТребуетсяЗагрузка
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникДанных.Идентификатор,
	|	ИсточникДанных.Наименование,
	|	КлассификаторСырья.Ссылка,
	|	ИсточникДанных.Тип
	|";
	
	Запрос.УстановитьПараметр("ИсточникДанных", ИсточникДанных);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.КлассификаторСырьяГИСМТ");
		ЭлементБлокировки.ИсточникДанных = Результат;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Идентификатор", "Идентификатор");
		Блокировка.Заблокировать();
		
		Для Каждого СтрокаТаблицы Из Результат Цикл
			
			ТребуетсяЗагрузка = Ложь;
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.Ссылка) Тогда
				СправочникОбъект = СоздатьЭлемент();
			Иначе
				СправочникОбъект = СтрокаТаблицы.Ссылка.ПолучитьОбъект();
			КонецЕсли;
			
			СправочникОбъект.Идентификатор = СтрокаТаблицы.Идентификатор;
			Если ЗначениеЗаполнено(СтрокаТаблицы.Тип)
				И Не ЗначениеЗаполнено(СправочникОбъект.ВидПродукции) Тогда
				СправочникОбъект.ВидПродукции = ВидПродукцииПоИдентификаторуТипаСырья(СтрокаТаблицы.Тип);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СправочникОбъект.ВидПродукции) Тогда
				ТребуетсяЗагрузка = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.Наименование) Тогда
				СправочникОбъект.Наименование = СтрокаТаблицы.Наименование;
			Иначе
				СправочникОбъект.Наименование = СтрШаблон(НСтр("ru = '<Требуется загрузка> %1'"), СтрокаТаблицы.Идентификатор);
				ТребуетсяЗагрузка = Истина;
			КонецЕсли;
			
			СправочникОбъект.ТребуетсяЗагрузка = ТребуетсяЗагрузка;
			
			СправочникОбъект.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось обновить классификатор сырья ГИС МТ по причине:
			|%1'"),
			ПодробноеПредставлениеОшибки);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Загрузка классификатора сырья ГИСМТ'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстСообщения);
		ВызватьИсключение ПодробноеПредставлениеОшибки;
		
	КонецПопытки;

КонецПроцедуры

// Загрузить объект по данным из API ГИС МТ.
//
// Параметры:
//  ДанныеСырья - см. ДанныеОбъекта
//  ВидПродукции - СправочникСсылка.ВидыПродукцииИС - Вид продукции (ссылка)
//
// Возвращаемое значение:
//  СправочникСсылка.КлассификаторСырьяГИСМТ
//
Функция ЗагрузитьОбъект(ДанныеСырья, ВидПродукции = Неопределено) Экспорт
	
	Идентификатор = ДанныеСырья.Идентификатор;
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	| ФармСырье.Ссылка КАК Ссылка
	|ИЗ
	| Справочник.КлассификаторСырьяГИСМТ КАК ФармСырье
	|ГДЕ
	| ФармСырье.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() И ЗначениеЗаполнено(Результат.Ссылка) Тогда
		СправочникОбъект = Результат.Ссылка.ПолучитьОбъект();
	Иначе
		СправочникОбъект = СоздатьЭлемент();
		СправочникОбъект.Идентификатор = Идентификатор;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСырья.Наименование) Тогда
		СправочникОбъект.Наименование = ДанныеСырья.Наименование;
	Иначе
		СправочникОбъект.Наименование = Идентификатор;
	КонецЕсли;
	
	СправочникОбъект.ТребуетсяЗагрузка   = Ложь;
	
	Если ЗначениеЗаполнено(ВидПродукции) Тогда
		СправочникОбъект.ВидПродукции = ВидПродукции;
	ИначеЕсли ЗначениеЗаполнено(ДанныеСырья.Тип) Тогда
		СправочникОбъект.ВидПродукции = ВидПродукцииПоИдентификаторуТипаСырья(ДанныеСырья.Тип);
	КонецЕсли;
	
	СправочникОбъект.Записать();
	
	Возврат СправочникОбъект.Ссылка;
	
КонецФункции

Процедура СоздатьСырьеПоНоменклатуре(Данные) Экспорт
	
	Если Данные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаИдентификаторов = Новый ТаблицаЗначений();
	ТаблицаИдентификаторов.Колонки.Добавить("ИндексСтроки",  ОбщегоНазначения.ОписаниеТипаЧисло(5));
	ТаблицаИдентификаторов.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаИдентификаторов.Колонки.Добавить("Наименование",  ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаИдентификаторов.Колонки.Добавить("ВидПродукции",  Новый ОписаниеТипов("СправочникСсылка.ВидыПродукцииИС"));
	
	ТекущийИндекс = 0;
	Для Каждого СтрокаТаблицы Из Данные Цикл
		НоваяСтрока = ТаблицаИдентификаторов.Добавить();
		НоваяСтрока.Идентификатор = СтрокаТаблицы.ЗначениеШтрихкода;
		НоваяСтрока.ВидПродукции  = СтрокаТаблицы.ВидПродукции;
		НоваяСтрока.ИндексСтроки  = ТекущийИндекс;
		НоваяСтрока.Наименование  = ОбщегоНазначенияИС.ПредставлениеНоменклатуры(
			СтрокаТаблицы.Номенклатура, СтрокаТаблицы.Характеристика);
		ТекущийИндекс = ТекущийИндекс + 1;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаИдентификаторов.ИндексСтроки  КАК ИндексСтроки,
	|	ТаблицаИдентификаторов.Идентификатор КАК Идентификатор,
	|	ТаблицаИдентификаторов.Наименование  КАК Наименование,
	|	ТаблицаИдентификаторов.ВидПродукции  КАК ВидПродукции
	|ПОМЕСТИТЬ ТаблицаИдентификаторов
	|ИЗ
	|	&ТаблицаИдентификаторов КАК ТаблицаИдентификаторов
	|;
	|//
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ФармСырье.Ссылка, НЕОПРЕДЕЛЕНО) КАК Ссылка,
	|	ТаблицаИдентификаторов.Идентификатор     КАК Идентификатор,
	|	ТаблицаИдентификаторов.ИндексСтроки      КАК ИндексСтроки,
	|	ТаблицаИдентификаторов.Наименование      КАК Наименование,
	|	ТаблицаИдентификаторов.ВидПродукции      КАК ВидПродукции
	|ИЗ
	|	ТаблицаИдентификаторов КАК ТаблицаИдентификаторов
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСырьяГИСМТ КАК ФармСырье
	|	ПО ФармСырье.Идентификатор = ТаблицаИдентификаторов.Идентификатор
	|	И НЕ ФармСырье.ПометкаУдаления
	|";
	
	Запрос.УстановитьПараметр("ТаблицаИдентификаторов", ТаблицаИдентификаторов);
	
	СозданныеЭлементыПоИдентификаторы = Новый Соответствие();
	
	Попытка
		
		НачатьТранзакцию();
		
		ПоляИсточникаБлокировки = Новый Структура("Идентификатор", "Идентификатор");
		ОбщегоНазначенияИС.УстановитьУправляемуюБлокировку(
			Метаданные.Справочники.КлассификаторСырьяГИСМТ.ПолноеИмя(),
			ПоляИсточникаБлокировки,
			ТаблицаИдентификаторов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ТекущаяСтрока = Данные[Выборка.ИндексСтроки];
			Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
				ТекущаяСтрока.Сырье = Выборка.Ссылка;
				Продолжить;
			ИначеЕсли СозданныеЭлементыПоИдентификаторы[Выборка.Идентификатор] <> Неопределено Тогда
				ТекущаяСтрока.Сырье = СозданныеЭлементыПоИдентификаторы[Выборка.Идентификатор];
				Продолжить;
			КонецЕсли;
			
			СправочникОбъект = СоздатьЭлемент();
			СправочникОбъект.Идентификатор = Выборка.Идентификатор;
			Если ЗначениеЗаполнено(Выборка.Наименование) Тогда
				СправочникОбъект.Наименование = Выборка.Наименование;
			Иначе
				СправочникОбъект.ТребуетсяЗагрузка = Истина;
				СправочникОбъект.Наименование = СтрШаблон(НСтр("ru = '<Требуется загрузка> %1'"), Выборка.Идентификатор);
			КонецЕсли;
			
			Префиксы = РазборКодаМаркировкиИССлужебныйКлиентСерверПовтИсп.ПрефиксыВидовПродукцииИдентификационногоКодаСырья();
			
			ПодходящиеВидыПродукции = Новый Массив;
			Для Каждого КлючИЗначение Из Префиксы.ПрефиксыПоВидуПродукции Цикл
				Для Каждого Префикс Из КлючИЗначение.Значение Цикл
					Если СтрНачинаетсяС(Выборка.Идентификатор, Префикс) Тогда
						ПодходящиеВидыПродукции.Добавить(КлючИЗначение.Ключ);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			Если ПодходящиеВидыПродукции.Количество() > 1
				И ПодходящиеВидыПродукции.Найти(Выборка.ВидПродукции) <> Неопределено Тогда
				СправочникОбъект.ВидПродукции = Выборка.ВидПродукции;
			ИначеЕсли ПодходящиеВидыПродукции.Количество() = 1 Тогда
				СправочникОбъект.ВидПродукции = ПодходящиеВидыПродукции[0];
			КонецЕсли;
			СправочникОбъект.Записать();
			
			СозданныеЭлементыПоИдентификаторы[Выборка.Идентификатор] = СправочникОбъект.Ссылка;
			ТекущаяСтрока.Сырье = СправочникОбъект.Ссылка;
			
		КонецЦикла;
	
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		ШаблонТекста = НСтр("ru = 'Ошибка при создании классификаторов фармацевтического сырья с идентификаторами %1: %2'");
		ТекстОшибки = СтрШаблон(
			ШаблонТекста,
			СтрСоединить(ТаблицаИдентификаторов.ВыгрузитьКолонку("Идентификатор"), ", "),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ТекстОшибкиПодробно = СтрШаблон(
			ШаблонТекста,
			СтрСоединить(ТаблицаИдентификаторов.ВыгрузитьКолонку("Идентификатор"), ", "),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ОбщегоНазначенияИСМП.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиПодробно);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

// Возвращает вид продукции по идентификатору типа сырья. Если найдено несколько видов или ни одного,
// возвращает пустую ссылку.
//
// Параметры:
//   Тип - Строка - идентификатор типа сырья
//
// Возвращаемое значение:
//   СправочникСсылка.ВидыПродукцииИС - вид продукции, соответствующий идентификатору типа сырья
//   - СправочникСсылка.ВидыПродукцииИС - пустая ссылка, если видов продукции не один
Функция ВидПродукцииПоИдентификаторуТипаСырья(Тип) Экспорт
	
	ВидыПродукции = КонструкторИСМПКлиентСервер.ВидыПродукцииПоИдентификаторуТипаСырья(Тип);
	Если ВидыПродукции.Количество() = 1 Тогда
		Возврат ВидыПродукции[0];
	Иначе
		Возврат ПредопределенноеЗначение("Справочник.ВидыПродукцииИС.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаВыбора" Тогда
	
		Если Параметры = Неопределено Тогда
			Параметры = Новый Структура();
		КонецЕсли;
		
		Параметры.Вставить("РежимВыбора", Истина);
		
		ВыбраннаяФорма       = "Справочник.КлассификаторСырьяГИСМТ.Форма.ФормаСписка";
		СтандартнаяОбработка = Ложь;
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
